# Handling Duplicate Data

In [1]:
# if there is rows similar to each other in all ways then only it is duplicate data

In [2]:
import pandas as pd

In [11]:
data = {"name":['a','b','c','d','a','c'], "eng":[8,7,5,8,8,5], "hindi":[2,3,4,5,2,6]}
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [4]:
# here 0th and 4th row have everything same hence it is duplicate data

In [8]:
#df["duplicated"] = df.duplicated()
#df

  name  eng  hindi  duplicated
0    a    8      2       False
1    b    7      3       False
2    c    5      4       False
3    d    8      5       False
4    a    8      2        True
5    c    5      6       False

In [12]:
df.drop_duplicates(keep="first")

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [13]:
df.drop_duplicates(inplace=True)

In [14]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [16]:
dataset = pd.read_csv("Online Sales Data.csv")
dataset.head(3)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001.0,01-01-2024,NaN,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002.0,02-01-2024,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003.0,03-01-2024,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card

In [17]:
dataset.shape

(240, 9)

In [18]:
dataset.drop_duplicates(inplace=True)

In [19]:
dataset.shape

(240, 9)

In [20]:
#this means no duplicate value